Procedure Posting(Cancel,Mode)
	ПроверитьКоличество(Cancel);
	
	//{{__REGISTER_RECORD_WIZARD
	//This fragment was built by the wizard.
	//Warning! All manually made changes will be lost next time you use the wizard.

	// register ОстаткиТоваров
	RegisterRecords.ОстаткиТоваров.Write = True;
	For Each CurRowТовары In Товары Do
		Record = RegisterRecords.ОстаткиТоваров.Add();
		Record.Period = Date;
		Record.RecordType = AccumulationRecordType.Expense;
		Record.Товар = CurRowТовары.Товар;
		Record.Количество = CurRowТовары.Количество;
	EndDo;

	//}}__REGISTER_RECORD_WIZARD
	
	ПроверитьОстатки(Cancel);
EndProcedure

Процедура ПроверитьКоличество(Отказ)
	Для Каждого СтрокаТовара Из Товары Цикл
		Если СтрокаТовара.Количество <= 0 Тогда
			Сообщить("Проверьте кол-во в позиции.");
            Отказ = Истина;
            
            Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


Процедура ПроверитьОстатки(Отказ)
	Движения.ОстаткиТоваров.БлокироватьДляИзменения = Истина;
    Движения.ОстаткиТоваров.Записать();

    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ ПЕРВЫЕ 1 Остатки.Товар
        |    ИЗ РегистрНакопления.ОстаткиТоваров.Остатки( &Момент, Товар В (&Товары)) КАК Остатки
        |ГДЕ Остатки.КоличествоОстаток < 0";

    Запрос.УстановитьПараметр("Момент", Новый Граница(МоментВремени(), ВидГраницы.Включая));
    Запрос.УстановитьПараметр("Товары", Товары.ВыгрузитьКолонку("Товар"));

    Если Не Запрос.Выполнить().Пустой() Тогда
        Сообщить("Недостаточно товара.");
        Отказ = Истина;
    КонецЕсли;
КонецПроцедуры