
&AtClient
Procedure ТоварыЦенаOnChange(Item)
	РассчитатьСуммуПозиции();
EndProcedure

&AtClient
Procedure ТоварыКоличествоOnChange(Item)
	РассчитатьСуммуПозиции();
EndProcedure

&AtClient
Процедура РассчитатьСуммуПозиции()

    ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;

    Если ТекущаяСтрока = Неопределено Тогда
        Возврат;
    КонецЕсли;

    Если Не ЗначениеЗаполнено(ТекущаяСтрока.Количество) Или 
         Не ЗначениеЗаполнено(ТекущаяСтрока.Цена) Тогда

        ТекущаяСтрока.Сумма = 0;
        Возврат;

    КонецЕсли;

    ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;

КонецПроцедуры
